In [6]:
import pandas as pd
import numpy as np

## Series

In [ ]:
nums = pd.Series([1, 2, 3]) # list
nums.head() # to print series
print(nums[2]) # print value at index 2

In [2]:
custom_index = pd.Series(['1', float('NaN'), 3], index=['a', 11, 12]) # NaN means not a number
custom_index.head()

a       1
11    NaN
12      3
dtype: object

## DataFrame

In [3]:
# using list
product_data=[['e-book', 2000], ['plants', 6000], ['Pencil', 3000]] # 2d list, similar to 2d array
indexes=[1,2,3]
columns_name=['product', 'unit_sold']
product_df = pd.DataFrame(data=product_data, index=indexes, columns=columns_name)
print(product_df)

  product  unit_sold
1  e-book       2000
2  plants       6000
3  Pencil       3000

In [4]:
# using dictionaries
product_data={'product': ['e-book', 'plants', 'Pencil'], 'unit_sold': [2000, 5000, 3000]}
product_df = pd.DataFrame(data=product_data)
print(product_df)

  product  unit_sold
0  e-book       2000
1  plants       5000
2  Pencil       3000

In [9]:
# using numpy array
products = np.array([['','product','unit_sold'], 
                     [1, 'E-book', 2000],
                     [2, 'Plants', 6000], 
                     [3, 'Pencil', 3000]])
product_pf = pd.DataFrame(data=products[1:,1:], # [1:,1:] from first row till end, from first column till end
                          index=products[1:,0], # [1:,0] from first row till end, only first column
                          columns=products[0,1:]) # [1:,0] only first row, form first column till end
print(product_pf) # output is same as of first case

  product unit_sold
1  E-book      2000
2  Plants      6000
3  Pencil      3000

## Index and Labels

In [11]:
row = product_df.iloc[2] # fetch third row
row
# rows

product      Pencil
unit_sold      3000
Name: 2, dtype: object

In [12]:
rows = product_df.iloc[0:2] # fetch rows from first till third but not third
rows

  product  unit_sold
0  e-book       2000
1  plants       5000

In [17]:
product_df['product'] # return column as series object

0    False
1     True
2     True
Name: unit_sold, dtype: bool

In [ ]:
gt_products = product_df['unit_sold'] > 2500 # return a series object of bool, for values greater than 2500
gt_products

In [19]:
# calculate next month target by increasing 10% and store the resultant series object in product_df under next_target column
product_df['next_target'] = product_df['unit_sold'] + ( product_df['unit_sold'] * 10)/100
product_df['next_target']

0    2200.0
1    5500.0
2    3300.0
Name: next_target, dtype: float64

## Import or Export Data

In [21]:
guest_list_df = pd.read_csv('daily_show_guests.csv') # separator can also be changed
print(guest_list_df.head(5))

   YEAR GoogleKnowlege_Occupation     Show   Group    Raw_Guest_List
0  1999                     actor  1/11/99  Acting    Michael J. Fox
1  1999                  Comedian  1/12/99  Comedy   Sandra Bernhard
2  1999        television actress  1/13/99  Acting     Tracey Ullman
3  1999              film actress  1/14/99  Acting  Gillian Anderson
4  1999                     actor  1/18/99  Acting  David Alan Grier

## Data Manipulation

In [23]:
# sorting
sorted_guest_df = guest_list_df.sort_values('GoogleKnowlege_Occupation', # sort by column
                                 ascending=False, # enable descending order
                                 kind='heapsort', #sorting algorithm
                                 na_position='last') # keep NaN value at last
sorted_guest_df

,YEAR,GoogleKnowlege_Occupation,Show,Group,Raw_Guest_List
2558,2014,writer,7/14/14,Media,Dahlia Lithwick
473,2001,writer,8/13/01,Media,David Rakoff
319,2000,writer,8/4/00,Media,Robert Reich and Ben Stein
1504,2008,writer,2/14/08,Media,Lee Siegel
306,2000,writer,7/25/00,Media,Joe Eszterhas
...,...,...,...,...,...
2145,2012,NaN,11/6/12,NaN,Election Night: This Ends Now
2175,2012,NaN,3/15/12,NaN,NaN
2248,2012,NaN,8/31/12,NaN,none
2263,2012,NaN,9/7/12,NaN,none
2393,2013,NaN,6/6/13,NaN,No Guest

In [26]:
# Merge
merge_guest_df = pd.merge(guest_list_df.head(3),
                           guest_list_df.tail(3),
                           how='outer',
                           indicator = True)
merge_guest_df

,YEAR,GoogleKnowlege_Occupation,Show,Group,Raw_Guest_List,_merge
0,1999,actor,1/11/99,Acting,Michael J. Fox,left_only
1,1999,Comedian,1/12/99,Comedy,Sandra Bernhard,left_only
2,1999,television actress,1/13/99,Acting,Tracey Ullman,left_only
3,2015,stand-up comedian,8/3/15,Comedy,Amy Schumer,right_only
4,2015,actor,8/4/15,Acting,Denis Leary,right_only
5,2015,comedian,8/5/15,Comedy,Louis C.K.,right_only

In [25]:
# concatenate
top_df = guest_list_df.head(3)
bottom_df = guest_list_df.tail(3)
combined_guest_df = pd.concat( [top_df, bottom_df] )

In [27]:
# grouping
guest_group = guest_list_df.groupby('Group')
print(guest_group.get_group('Acting'))

      YEAR GoogleKnowlege_Occupation     Show   Group    Raw_Guest_List
0     1999                     actor  1/11/99  Acting    Michael J. Fox
2     1999        television actress  1/13/99  Acting     Tracey Ullman
3     1999              film actress  1/14/99  Acting  Gillian Anderson
4     1999                     actor  1/18/99  Acting  David Alan Grier
5     1999                     actor  1/19/99  Acting   William Baldwin
...    ...                       ...      ...     ...               ...
2679  2015                     actor   6/9/15  Acting     Nick Offerman
2682  2015                     actor  7/20/15  Acting         Paul Rudd
2684  2015                     actor  7/22/15  Acting   Jake Gyllenhaal
2687  2015                     actor  7/28/15  Acting        Tom Cruise
2691  2015                     actor   8/4/15  Acting       Denis Leary

[930 rows x 5 columns]

In [31]:
# renaming
guest_list_rename_df = guest_list_df.rename(columns={'Group':'Occupation'})
guest_list_rename_df

      YEAR GoogleKnowlege_Occupation     Show Occupation        Raw_Guest_List
0     1999                     actor  1/11/99     Acting        Michael J. Fox
1     1999                  Comedian  1/12/99     Comedy       Sandra Bernhard
2     1999        television actress  1/13/99     Acting         Tracey Ullman
3     1999              film actress  1/14/99     Acting      Gillian Anderson
4     1999                     actor  1/18/99     Acting      David Alan Grier
...    ...                       ...      ...        ...                   ...
2688  2015                biographer  7/29/15      Media  Doris Kearns Goodwin
2689  2015                  director  7/30/15      Media          J. J. Abrams
2690  2015         stand-up comedian   8/3/15     Comedy           Amy Schumer
2691  2015                     actor   8/4/15     Acting           Denis Leary
2692  2015                  comedian   8/5/15     Comedy            Louis C.K.

[2693 rows x 5 columns]

## Data Cleaning

In [33]:
# Look for missing data
guest_list_df.isnull().values.any() # verify if any value is null

True

In [34]:
guest_list_df.isnull().sum() # display summary of null values per column

YEAR                          0
GoogleKnowlege_Occupation    26
Show                          0
Group                        31
Raw_Guest_List                4
dtype: int64

In [40]:
# reolace NA and NaN values with desired value
product_data={'product': ['E-book', 'Plants'], 'unit_sold': [12, np.NaN]} # need to import numpy as np
product_df = pd.DataFrame(data=product_data)
product_df.fillna(0, inplace=True) # tell fillna what to replace na with, here it is 0
product_df

  product  unit_sold
0  E-book       12.0
1  Plants        0.0

In [41]:
# drop duplications
df = pd.DataFrame({'Name':['Pavneet','Pavneet']}, index=[1,2])
df.drop_duplicates(subset='Name',keep='last')

      Name
2  Pavneet

## Data Analysis

In [42]:
product_df = pd.DataFrame(data={'product': ['E-book', 'Plants'],
                                'unit_sold': [2000, 5000],
                                'types': [800, 200]})
product_df.describe()

         unit_sold       types
count     2.000000    2.000000
mean   3500.000000  500.000000
std    2121.320344  424.264069
min    2000.000000  200.000000
25%    2750.000000  350.000000
50%    3500.000000  500.000000
75%    4250.000000  650.000000
max    5000.000000  800.000000

In [43]:
product_df['unit_sold'].mean()

3500.0

In [51]:
product_df = pd.DataFrame(data={'product': ['E-book', 'Plants'],
                                'unit_sold': [2000, 5000],
                                'types': [800, 200]})
product_df

  product  unit_sold  types
0  E-book       2000    800
1  Plants       5000    200

## Data Storage

In [52]:
product_df = pd.DataFrame(data={'product': ['E-book', 'Plants'],
                        'unit_sold': [2000, 5000],
                        'types': [800, 200]})
product_df.to_csv('aa.csv',
                  index=False, # otherwise will add extra comma at start
                  sep=',',
                  encoding='utf-8')